newguccio/MEMS_STM32_Practice/Drivers/BSP/Components/lsm6dso16is/lsm6dso16is_reg.h
#define LSM6DSO16IS_INT1_CTRL                       0x0DU
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t int1_drdy_xl                 : 1;
  uint8_t int1_drdy_g                  : 1;
  uint8_t int1_boot                    : 1;
  uint8_t not_used0                    : 5;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t not_used0                    : 5;
  uint8_t int1_boot                    : 1;
  uint8_t int1_drdy_g                  : 1;
  uint8_t int1_drdy_xl                 : 1;
#endif /* DRV_BYTE_ORDER */
} lsm6dso16is_int1_ctrl_t;

#define LSM6DSO16IS_INT2_CTRL                       0x0EU
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t int2_drdy_xl                 : 1;
  uint8_t int2_drdy_g                  : 1;
  uint8_t int2_drdy_temp               : 1;
  uint8_t not_used0                    : 4;
  uint8_t int2_sleep_ispu              : 1;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t int2_sleep_ispu              : 1;
  uint8_t not_used0                    : 4;
  uint8_t int2_drdy_temp               : 1;
  uint8_t int2_drdy_g                  : 1;
  uint8_t int2_drdy_xl                 : 1;
#endif /* DRV_BYTE_ORDER */
} lsm6dso16is_int2_ctrl_t;

#define LSM6DSO16IS_WHO_AM_I                        0x0FU
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t id                           : 8;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t id                           : 8;
#endif /* DRV_BYTE_ORDER */
} lsm6dso16is_who_am_i_t;

#define LSM6DSO16IS_CTRL1_XL                        0x10U
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t not_used0                    : 2;
  uint8_t fs_xl                        : 2;
  uint8_t odr_xl                       : 4;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t odr_xl                       : 4;
  uint8_t fs_xl                        : 2;
  uint8_t not_used0                    : 2;
#endif /* DRV_BYTE_ORDER */
} lsm6dso16is_ctrl1_xl_t;

#define LSM6DSO16IS_CTRL2_G                         0x11U
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t not_used0                    : 1;
  uint8_t fs_125                       : 1;
  uint8_t fs_g                         : 2;
  uint8_t odr_g                        : 4;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t odr_g                        : 4;
  uint8_t fs_g                         : 2;
  uint8_t fs_125                       : 1;
  uint8_t not_used0                    : 1;
#endif /* DRV_BYTE_ORDER */
} lsm6dso16is_ctrl2_g_t;

#define LSM6DSO16IS_CTRL3_C                         0x12U
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t sw_reset                     : 1;
  uint8_t not_used0                    : 1;
  uint8_t if_inc                       : 1;
  uint8_t sim                          : 1;
  uint8_t pp_od                        : 1;
  uint8_t h_lactive                    : 1;
  uint8_t bdu                          : 1;
  uint8_t boot                         : 1;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t boot                         : 1;
  uint8_t bdu                          : 1;
  uint8_t h_lactive                    : 1;
  uint8_t pp_od                        : 1;
  uint8_t sim                          : 1;
  uint8_t if_inc                       : 1;
  uint8_t not_used0                    : 1;
  uint8_t sw_reset                     : 1;
#endif /* DRV_BYTE_ORDER */
} lsm6dso16is_ctrl3_c_t;

#define LSM6DSO16IS_CTRL4_C                         0x13U
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t not_used0                    : 2;
  uint8_t i2c_disable                  : 1;
  uint8_t not_used1                    : 2;
  uint8_t int2_on_int1                 : 1;
  uint8_t sleep_g                      : 1;
  uint8_t not_used2                    : 1;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t not_used2                    : 1;
  uint8_t sleep_g                      : 1;
  uint8_t int2_on_int1                 : 1;
  uint8_t not_used1                    : 2;
  uint8_t i2c_disable                  : 1;
  uint8_t not_used0                    : 2;
#endif /* DRV_BYTE_ORDER */
} lsm6dso16is_ctrl4_c_t;

#define LSM6DSO16IS_CTRL5_C                         0x14U
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t st_xl                        : 2;
  uint8_t st_g                         : 2;
  uint8_t not_used0                    : 4;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t not_used0                    : 4;
  uint8_t st_g                         : 2;
  uint8_t st_xl                        : 2;
#endif /* DRV_BYTE_ORDER */
} lsm6dso16is_ctrl5_c_t;

#define LSM6DSO16IS_CTRL6_C                         0x15U
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t not_used0                    : 4;
  uint8_t xl_hm_mode                   : 1;
  uint8_t not_used1                    : 3;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t not_used1                    : 3;
  uint8_t xl_hm_mode                   : 1;
  uint8_t not_used0                    : 4;
#endif /* DRV_BYTE_ORDER */
} lsm6dso16is_ctrl6_c_t;

#define LSM6DSO16IS_CTRL7_G                         0x16U
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t not_used0                    : 7;
  uint8_t g_hm_mode                    : 1;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t g_hm_mode                    : 1;
  uint8_t not_used0                    : 7;
#endif /* DRV_BYTE_ORDER */
} lsm6dso16is_ctrl7_g_t;

#define LSM6DSO16IS_CTRL9_C                         0x18U
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t ispu_bdu                     : 2;
  uint8_t not_used0                    : 2;
  uint8_t ispu_rate                    : 4;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t ispu_rate                    : 4;
  uint8_t not_used0                    : 2;
  uint8_t ispu_bdu                     : 2;
#endif /* DRV_BYTE_ORDER */
} lsm6dso16is_ctrl9_c_t;

#define LSM6DSO16IS_CTRL10_C                        0x19U
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t not_used0                    : 2;
  uint8_t ispu_clk_sel                 : 1;
  uint8_t not_used1                    : 2;
  uint8_t timestamp_en                 : 1;
  uint8_t not_used2                    : 2;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t not_used2                    : 2;
  uint8_t timestamp_en                 : 1;
  uint8_t not_used1                    : 2;
  uint8_t ispu_clk_sel                 : 1;
  uint8_t not_used0                    : 2;
#endif /* DRV_BYTE_ORDER */
} lsm6dso16is_ctrl10_c_t;

#define LSM6DSO16IS_ISPU_INT_STATUS0_MAINPAGE       0x1AU
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t ia_ispu                      : 8;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t ia_ispu                      : 8;
#endif /* DRV_BYTE_ORDER */
} lsm6dso16is_ispu_int_status0_mainpage_t;

