newguccio/MEMS_STM32_Practice/Drivers/BSP/Components/lsm6dso16is/lsm6dso16is_reg.h
#define LSM6DSO16IS_STATUS_MASTER_MAINPAGE          0x39U
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t sens_hub_endop               : 1;
  uint8_t not_used0                    : 2;
  uint8_t slave0_nack                  : 1;
  uint8_t slave1_nack                  : 1;
  uint8_t slave2_nack                  : 1;
  uint8_t slave3_nack                  : 1;
  uint8_t wr_once_done                 : 1;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t wr_once_done                 : 1;
  uint8_t slave3_nack                  : 1;
  uint8_t slave2_nack                  : 1;
  uint8_t slave1_nack                  : 1;
  uint8_t slave0_nack                  : 1;
  uint8_t not_used0                    : 2;
  uint8_t sens_hub_endop               : 1;
#endif /* DRV_BYTE_ORDER */
} lsm6dso16is_status_master_mainpage_t;

#define LSM6DSO16IS_TIMESTAMP0                      0x40U
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t timestamp                    : 8;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t timestamp                    : 8;
#endif /* DRV_BYTE_ORDER */
} lsm6dso16is_timestamp0_t;

#define LSM6DSO16IS_TIMESTAMP1                      0x41U
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t timestamp                    : 8;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t timestamp                    : 8;
#endif /* DRV_BYTE_ORDER */
} lsm6dso16is_timestamp1_t;

#define LSM6DSO16IS_TIMESTAMP2                      0x42U
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t timestamp                    : 8;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t timestamp                    : 8;
#endif /* DRV_BYTE_ORDER */
} lsm6dso16is_timestamp2_t;

#define LSM6DSO16IS_TIMESTAMP3                      0x43U
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t timestamp                    : 8;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t timestamp                    : 8;
#endif /* DRV_BYTE_ORDER */
} lsm6dso16is_timestamp3_t;

#define LSM6DSO16IS_MD1_CFG                         0x5EU
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t int1_shub                    : 1;
  uint8_t int1_ispu                    : 1;
  uint8_t not_used0                    : 6;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t not_used0                    : 6;
  uint8_t int1_ispu                    : 1;
  uint8_t int1_shub                    : 1;
#endif /* DRV_BYTE_ORDER */
} lsm6dso16is_md1_cfg_t;

#define LSM6DSO16IS_MD2_CFG                         0x5FU
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t int2_timestamp               : 1;
  uint8_t int2_ispu                    : 1;
  uint8_t not_used0                    : 6;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t not_used0                    : 6;
  uint8_t int2_ispu                    : 1;
  uint8_t int2_timestamp               : 1;
#endif /* DRV_BYTE_ORDER */
} lsm6dso16is_md2_cfg_t;

#define LSM6DSO16IS_INTERNAL_FREQ_FINE              0x63U
typedef struct
{
  uint8_t freq_fine                    : 8;
} lsm6dso16is_internal_freq_fine_t;

#define LSM6DSO16IS_ISPU_DUMMY_CFG_1_L              0x73U
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t ispu_dummy_cfg_1             : 8;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t ispu_dummy_cfg_1             : 8;
#endif /* DRV_BYTE_ORDER */
} lsm6dso16is_ispu_dummy_cfg_1_l_t;

#define LSM6DSO16IS_ISPU_DUMMY_CFG_1_H              0x74U
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t ispu_dummy_cfg_1             : 8;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t ispu_dummy_cfg_1             : 8;
#endif /* DRV_BYTE_ORDER */
} lsm6dso16is_ispu_dummy_cfg_1_h_t;

#define LSM6DSO16IS_ISPU_DUMMY_CFG_2_L              0x75U
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t ispu_dummy_cfg_2             : 8;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t ispu_dummy_cfg_2             : 8;
#endif /* DRV_BYTE_ORDER */
} lsm6dso16is_ispu_dummy_cfg_2_l_t;

#define LSM6DSO16IS_ISPU_DUMMY_CFG_2_H              0x76U
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t ispu_dummy_cfg_2             : 8;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t ispu_dummy_cfg_2             : 8;
#endif /* DRV_BYTE_ORDER */
} lsm6dso16is_ispu_dummy_cfg_2_h_t;

#define LSM6DSO16IS_ISPU_DUMMY_CFG_3_L              0x77U
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t ispu_dummy_cfg_3             : 8;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t ispu_dummy_cfg_3             : 8;
#endif /* DRV_BYTE_ORDER */
} lsm6dso16is_ispu_dummy_cfg_3_l_t;

#define LSM6DSO16IS_ISPU_DUMMY_CFG_3_H              0x78U
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t ispu_dummy_cfg_3             : 8;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t ispu_dummy_cfg_3             : 8;
#endif /* DRV_BYTE_ORDER */
} lsm6dso16is_ispu_dummy_cfg_3_h_t;

#define LSM6DSO16IS_ISPU_DUMMY_CFG_4_L              0x79U
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t ispu_dummy_cfg_4             : 8;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t ispu_dummy_cfg_4             : 8;
#endif /* DRV_BYTE_ORDER */
} lsm6dso16is_ispu_dummy_cfg_4_l_t;

#define LSM6DSO16IS_ISPU_DUMMY_CFG_4_H              0x7AU
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t ispu_dummy_cfg_4             : 8;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t ispu_dummy_cfg_4             : 8;
#endif /* DRV_BYTE_ORDER */
} lsm6dso16is_ispu_dummy_cfg_4_h_t;

/**
  * @}
  *
  */

/** @defgroup bitfields page sensor_hub
  * @{
  *
  */

#define LSM6DSO16IS_SENSOR_HUB_1                    0x2U
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t sensorhub1                   : 8;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t sensorhub1                   : 8;
#endif /* DRV_BYTE_ORDER */
} lsm6dso16is_sensor_hub_1_t;

#define LSM6DSO16IS_SENSOR_HUB_2                    0x3U
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t sensorhub2                   : 8;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t sensorhub2                   : 8;
#endif /* DRV_BYTE_ORDER */
} lsm6dso16is_sensor_hub_2_t;

#define LSM6DSO16IS_SENSOR_HUB_3                    0x4U
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t sensorhub3                   : 8;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t sensorhub3                   : 8;
#endif /* DRV_BYTE_ORDER */
} lsm6dso16is_sensor_hub_3_t;

#define LSM6DSO16IS_SENSOR_HUB_4                    0x5U
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t sensorhub4                   : 8;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t sensorhub4                   : 8;
#endif /* DRV_BYTE_ORDER */
} lsm6dso16is_sensor_hub_4_t;

#define LSM6DSO16IS_SENSOR_HUB_5                    0x6U
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t sensorhub5                   : 8;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t sensorhub5                   : 8;
#endif /* DRV_BYTE_ORDER */
} lsm6dso16is_sensor_hub_5_t;

