newguccio/MEMS_STM32_Practice/Drivers/BSP/Components/lsm6dso16is/lsm6dso16is_reg.h
#define LSM6DSO16IS_SENSOR_HUB_6                    0x7U
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t sensorhub6                   : 8;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t sensorhub6                   : 8;
#endif /* DRV_BYTE_ORDER */
} lsm6dso16is_sensor_hub_6_t;

#define LSM6DSO16IS_SENSOR_HUB_7                    0x8U
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t sensorhub7                   : 8;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t sensorhub7                   : 8;
#endif /* DRV_BYTE_ORDER */
} lsm6dso16is_sensor_hub_7_t;

#define LSM6DSO16IS_SENSOR_HUB_8                    0x9U
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t sensorhub8                   : 8;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t sensorhub8                   : 8;
#endif /* DRV_BYTE_ORDER */
} lsm6dso16is_sensor_hub_8_t;

#define LSM6DSO16IS_SENSOR_HUB_9                    0x0AU
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t sensorhub9                   : 8;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t sensorhub9                   : 8;
#endif /* DRV_BYTE_ORDER */
} lsm6dso16is_sensor_hub_9_t;

#define LSM6DSO16IS_SENSOR_HUB_10                   0x0BU
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t sensorhub10                  : 8;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t sensorhub10                  : 8;
#endif /* DRV_BYTE_ORDER */
} lsm6dso16is_sensor_hub_10_t;

#define LSM6DSO16IS_SENSOR_HUB_11                   0x0CU
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t sensorhub11                  : 8;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t sensorhub11                  : 8;
#endif /* DRV_BYTE_ORDER */
} lsm6dso16is_sensor_hub_11_t;

#define LSM6DSO16IS_SENSOR_HUB_12                   0x0DU
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t sensorhub12                  : 8;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t sensorhub12                  : 8;
#endif /* DRV_BYTE_ORDER */
} lsm6dso16is_sensor_hub_12_t;

#define LSM6DSO16IS_SENSOR_HUB_13                   0x0EU
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t sensorhub13                  : 8;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t sensorhub13                  : 8;
#endif /* DRV_BYTE_ORDER */
} lsm6dso16is_sensor_hub_13_t;

#define LSM6DSO16IS_SENSOR_HUB_14                   0x0FU
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t sensorhub14                  : 8;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t sensorhub14                  : 8;
#endif /* DRV_BYTE_ORDER */
} lsm6dso16is_sensor_hub_14_t;

#define LSM6DSO16IS_SENSOR_HUB_15                   0x10U
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t sensorhub15                  : 8;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t sensorhub15                  : 8;
#endif /* DRV_BYTE_ORDER */
} lsm6dso16is_sensor_hub_15_t;

#define LSM6DSO16IS_SENSOR_HUB_16                   0x11U
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t sensorhub16                  : 8;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t sensorhub16                  : 8;
#endif /* DRV_BYTE_ORDER */
} lsm6dso16is_sensor_hub_16_t;

#define LSM6DSO16IS_SENSOR_HUB_17                   0x12U
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t sensorhub17                  : 8;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t sensorhub17                  : 8;
#endif /* DRV_BYTE_ORDER */
} lsm6dso16is_sensor_hub_17_t;

#define LSM6DSO16IS_SENSOR_HUB_18                   0x13U
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t sensorhub18                  : 8;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t sensorhub18                  : 8;
#endif /* DRV_BYTE_ORDER */
} lsm6dso16is_sensor_hub_18_t;

#define LSM6DSO16IS_MASTER_CONFIG                   0x14U
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t aux_sens_on                  : 2;
  uint8_t master_on                    : 1;
  uint8_t shub_pu_en                   : 1;
  uint8_t pass_through_mode            : 1;
  uint8_t start_config                 : 1;
  uint8_t write_once                   : 1;
  uint8_t rst_master_regs              : 1;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t rst_master_regs              : 1;
  uint8_t write_once                   : 1;
  uint8_t start_config                 : 1;
  uint8_t pass_through_mode            : 1;
  uint8_t shub_pu_en                   : 1;
  uint8_t master_on                    : 1;
  uint8_t aux_sens_on                  : 2;
#endif /* DRV_BYTE_ORDER */
} lsm6dso16is_master_config_t;

#define LSM6DSO16IS_SLV0_ADD                        0x15U
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t rw_0                         : 1;
  uint8_t slave0_add                   : 7;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t slave0_add                   : 7;
  uint8_t rw_0                         : 1;
#endif /* DRV_BYTE_ORDER */
} lsm6dso16is_slv0_add_t;

#define LSM6DSO16IS_SLV0_SUBADD                     0x16U
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t slave0_reg                   : 8;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t slave0_reg                   : 8;
#endif /* DRV_BYTE_ORDER */
} lsm6dso16is_slv0_subadd_t;

#define LSM6DSO16IS_SLV0_CONFIG                   0x17U
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t slave0_numop                 : 3;
  uint8_t not_used0                    : 3;
  uint8_t shub_odr                     : 2;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t shub_odr                     : 2;
  uint8_t not_used0                    : 3;
  uint8_t slave0_numop                 : 3;
#endif /* DRV_BYTE_ORDER */
} lsm6dso16is_slv0_config_t;

#define LSM6DSO16IS_SLV1_ADD                        0x18U
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t r_1                          : 1;
  uint8_t slave1_add                   : 7;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t slave1_add                   : 7;
  uint8_t r_1                          : 1;
#endif /* DRV_BYTE_ORDER */
} lsm6dso16is_slv1_add_t;

#define LSM6DSO16IS_SLV1_SUBADD                     0x19U
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t slave1_reg                   : 8;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t slave1_reg                   : 8;
#endif /* DRV_BYTE_ORDER */
} lsm6dso16is_slv1_subadd_t;

#define LSM6DSO16IS_SLV1_CONFIG                   0x1AU
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t slave1_numop                 : 3;
  uint8_t not_used0                    : 5;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t not_used0                    : 5;
  uint8_t slave1_numop                 : 3;
#endif /* DRV_BYTE_ORDER */
} lsm6dso16is_slv1_config_t;

#define LSM6DSO16IS_SLV2_ADD                        0x1BU
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t r_2                          : 1;
  uint8_t slave2_add                   : 7;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t slave2_add                   : 7;
  uint8_t r_2                          : 1;
#endif /* DRV_BYTE_ORDER */
} lsm6dso16is_slv2_add_t;

#define LSM6DSO16IS_SLV2_SUBADD                     0x1CU
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t slave2_reg                   : 8;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t slave2_reg                   : 8;
#endif /* DRV_BYTE_ORDER */
} lsm6dso16is_slv2_subadd_t;

#define LSM6DSO16IS_SLV2_CONFIG                   0x1DU
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t slave2_numop                 : 3;
  uint8_t not_used0                    : 5;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t not_used0                    : 5;
  uint8_t slave2_numop                 : 3;
#endif /* DRV_BYTE_ORDER */
} lsm6dso16is_slv2_config_t;

