newguccio/MEMS_STM32_Practice/Drivers/BSP/Components/lsm6dso16is/lsm6dso16is_reg.h
#define LSM6DSO16IS_SLV3_ADD                        0x1EU
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t r_3                          : 1;
  uint8_t slave3_add                   : 7;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t slave3_add                   : 7;
  uint8_t r_3                          : 1;
#endif /* DRV_BYTE_ORDER */
} lsm6dso16is_slv3_add_t;

#define LSM6DSO16IS_SLV3_SUBADD                     0x1FU
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t slave3_reg                   : 8;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t slave3_reg                   : 8;
#endif /* DRV_BYTE_ORDER */
} lsm6dso16is_slv3_subadd_t;

#define LSM6DSO16IS_SLV3_CONFIG                   0x20U
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t slave3_numop                 : 3;
  uint8_t not_used0                    : 5;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t not_used0                    : 5;
  uint8_t slave3_numop                 : 3;
#endif /* DRV_BYTE_ORDER */
} lsm6dso16is_slv3_config_t;

#define LSM6DSO16IS_DATAWRITE_SLV0                  0x21U
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t slave0_dataw                 : 8;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t slave0_dataw                 : 8;
#endif /* DRV_BYTE_ORDER */
} lsm6dso16is_datawrite_slv0_t;

#define LSM6DSO16IS_STATUS_MASTER                   0x22U
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t sens_hub_endop               : 1;
  uint8_t not_used0                    : 2;
  uint8_t slave0_nack                  : 1;
  uint8_t slave1_nack                  : 1;
  uint8_t slave2_nack                  : 1;
  uint8_t slave3_nack                  : 1;
  uint8_t wr_once_done                 : 1;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t wr_once_done                 : 1;
  uint8_t slave3_nack                  : 1;
  uint8_t slave2_nack                  : 1;
  uint8_t slave1_nack                  : 1;
  uint8_t slave0_nack                  : 1;
  uint8_t not_used0                    : 2;
  uint8_t sens_hub_endop               : 1;
#endif /* DRV_BYTE_ORDER */
} lsm6dso16is_status_master_t;

/**
  * @}
  *
  */

/** @defgroup bitfields page ispu
  * @{
  *
  */

#define LSM6DSO16IS_ISPU_CONFIG                     0x2U
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t ispu_rst_n                   : 1;
  uint8_t clk_dis                      : 1;
  uint8_t not_used0                    : 2;
  uint8_t latched                      : 1;
  uint8_t not_used1                    : 3;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t not_used1                    : 3;
  uint8_t latched                      : 1;
  uint8_t not_used0                    : 2;
  uint8_t clk_dis                      : 1;
  uint8_t ispu_rst_n                   : 1;
#endif /* DRV_BYTE_ORDER */
} lsm6dso16is_ispu_config_t;

#define LSM6DSO16IS_ISPU_STATUS                     0x4U
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t not_used0                    : 2;
  uint8_t boot_end                     : 1;
  uint8_t not_used1                    : 5;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t not_used1                    : 5;
  uint8_t boot_end                     : 1;
  uint8_t not_used0                    : 2;
#endif /* DRV_BYTE_ORDER */
} lsm6dso16is_ispu_status_t;

#define LSM6DSO16IS_ISPU_MEM_SEL                    0x8U
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t mem_sel                      : 1;
  uint8_t not_used0                    : 5;
  uint8_t read_mem_en                  : 1;
  uint8_t not_used1                    : 1;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t not_used1                    : 1;
  uint8_t read_mem_en                  : 1;
  uint8_t not_used0                    : 5;
  uint8_t mem_sel                      : 1;
#endif /* DRV_BYTE_ORDER */
} lsm6dso16is_ispu_mem_sel_t;

#define LSM6DSO16IS_ISPU_MEM_ADDR1                  0x9U
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t mem_addr                     : 8;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t mem_addr                     : 8;
#endif /* DRV_BYTE_ORDER */
} lsm6dso16is_ispu_mem_addr1_t;

#define LSM6DSO16IS_ISPU_MEM_ADDR0                  0x0AU
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t mem_addr                     : 8;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t mem_addr                     : 8;
#endif /* DRV_BYTE_ORDER */
} lsm6dso16is_ispu_mem_addr0_t;

#define LSM6DSO16IS_ISPU_MEM_DATA                   0x0BU
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t mem_data                     : 8;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t mem_data                     : 8;
#endif /* DRV_BYTE_ORDER */
} lsm6dso16is_ispu_mem_data_t;

#define LSM6DSO16IS_ISPU_IF2S_FLAG_L                0x0CU
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t if2s                         : 8;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t if2s                         : 8;
#endif /* DRV_BYTE_ORDER */
} lsm6dso16is_ispu_if2s_flag_l_t;

#define LSM6DSO16IS_ISPU_IF2S_FLAG_H                0x0DU
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t if2s                         : 8;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t if2s                         : 8;
#endif /* DRV_BYTE_ORDER */
} lsm6dso16is_ispu_if2s_flag_h_t;

#define LSM6DSO16IS_ISPU_S2IF_FLAG_L                0x0EU
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t s2if                         : 8;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t s2if                         : 8;
#endif /* DRV_BYTE_ORDER */
} lsm6dso16is_ispu_s2if_flag_l_t;

#define LSM6DSO16IS_ISPU_S2IF_FLAG_H                0x0FU
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t s2if                         : 8;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t s2if                         : 8;
#endif /* DRV_BYTE_ORDER */
} lsm6dso16is_ispu_s2if_flag_h_t;

