newguccio/MEMS_STM32_Practice/Drivers/BSP/Components/lsm6dso16is/lsm6dso16is_reg.h
#define LSM6DSO16IS_ISPU_DOUT_00_L                  0x10U
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t dout0                        : 8;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t dout0                        : 8;
#endif /* DRV_BYTE_ORDER */
} lsm6dso16is_ispu_dout_00_l_t;

#define LSM6DSO16IS_ISPU_DOUT_00_H                  0x11U
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t dout0                        : 8;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t dout0                        : 8;
#endif /* DRV_BYTE_ORDER */
} lsm6dso16is_ispu_dout_00_h_t;

#define LSM6DSO16IS_ISPU_DOUT_01_L                  0x12U
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t dout1                        : 8;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t dout1                        : 8;
#endif /* DRV_BYTE_ORDER */
} lsm6dso16is_ispu_dout_01_l_t;

#define LSM6DSO16IS_ISPU_DOUT_01_H                  0x13U
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t dout1                        : 8;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t dout1                        : 8;
#endif /* DRV_BYTE_ORDER */
} lsm6dso16is_ispu_dout_01_h_t;

#define LSM6DSO16IS_ISPU_DOUT_02_L                  0x14U
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t dout2                        : 8;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t dout2                        : 8;
#endif /* DRV_BYTE_ORDER */
} lsm6dso16is_ispu_dout_02_l_t;

#define LSM6DSO16IS_ISPU_DOUT_02_H                  0x15U
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t dout2                        : 8;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t dout2                        : 8;
#endif /* DRV_BYTE_ORDER */
} lsm6dso16is_ispu_dout_02_h_t;

#define LSM6DSO16IS_ISPU_DOUT_03_L                  0x16U
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t dout3                        : 8;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t dout3                        : 8;
#endif /* DRV_BYTE_ORDER */
} lsm6dso16is_ispu_dout_03_l_t;

#define LSM6DSO16IS_ISPU_DOUT_03_H                  0x17U
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t dout3                        : 8;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t dout3                        : 8;
#endif /* DRV_BYTE_ORDER */
} lsm6dso16is_ispu_dout_03_h_t;

#define LSM6DSO16IS_ISPU_DOUT_04_L                  0x18U
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t dout4                        : 8;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t dout4                        : 8;
#endif /* DRV_BYTE_ORDER */
} lsm6dso16is_ispu_dout_04_l_t;

#define LSM6DSO16IS_ISPU_DOUT_04_H                  0x19U
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t dout4                        : 8;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t dout4                        : 8;
#endif /* DRV_BYTE_ORDER */
} lsm6dso16is_ispu_dout_04_h_t;

#define LSM6DSO16IS_ISPU_DOUT_05_L                  0x1AU
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t dout5                        : 8;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t dout5                        : 8;
#endif /* DRV_BYTE_ORDER */
} lsm6dso16is_ispu_dout_05_l_t;

#define LSM6DSO16IS_ISPU_DOUT_05_H                  0x1BU
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t dout5                        : 8;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t dout5                        : 8;
#endif /* DRV_BYTE_ORDER */
} lsm6dso16is_ispu_dout_05_h_t;

#define LSM6DSO16IS_ISPU_DOUT_06_L                  0x1CU
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t dout6                        : 8;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t dout6                        : 8;
#endif /* DRV_BYTE_ORDER */
} lsm6dso16is_ispu_dout_06_l_t;

#define LSM6DSO16IS_ISPU_DOUT_06_H                  0x1DU
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t dout6                        : 8;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t dout6                        : 8;
#endif /* DRV_BYTE_ORDER */
} lsm6dso16is_ispu_dout_06_h_t;

#define LSM6DSO16IS_ISPU_DOUT_07_L                  0x1EU
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t dout7                        : 8;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t dout7                        : 8;
#endif /* DRV_BYTE_ORDER */
} lsm6dso16is_ispu_dout_07_l_t;

#define LSM6DSO16IS_ISPU_DOUT_07_H                  0x1FU
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t dout7                        : 8;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t dout7                        : 8;
#endif /* DRV_BYTE_ORDER */
} lsm6dso16is_ispu_dout_07_h_t;

#define LSM6DSO16IS_ISPU_DOUT_08_L                  0x20U
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t dout8                        : 8;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t dout8                        : 8;
#endif /* DRV_BYTE_ORDER */
} lsm6dso16is_ispu_dout_08_l_t;

#define LSM6DSO16IS_ISPU_DOUT_08_H                  0x21U
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t dout8                        : 8;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t dout8                        : 8;
#endif /* DRV_BYTE_ORDER */
} lsm6dso16is_ispu_dout_08_h_t;

#define LSM6DSO16IS_ISPU_DOUT_09_L                  0x22U
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t dout9                        : 8;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t dout9                        : 8;
#endif /* DRV_BYTE_ORDER */
} lsm6dso16is_ispu_dout_09_l_t;

#define LSM6DSO16IS_ISPU_DOUT_09_H                  0x23U
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t dout9                        : 8;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t dout9                        : 8;
#endif /* DRV_BYTE_ORDER */
} lsm6dso16is_ispu_dout_09_h_t;

