newguccio/MEMS_STM32_Practice/Drivers/BSP/Components/lsm6dso16is/lsm6dso16is_reg.h
#define LSM6DSO16IS_ISPU_DOUT_10_L                  0x24U
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t dout10                       : 8;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t dout10                       : 8;
#endif /* DRV_BYTE_ORDER */
} lsm6dso16is_ispu_dout_10_l_t;

#define LSM6DSO16IS_ISPU_DOUT_10_H                  0x25U
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t dout10                       : 8;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t dout10                       : 8;
#endif /* DRV_BYTE_ORDER */
} lsm6dso16is_ispu_dout_10_h_t;

#define LSM6DSO16IS_ISPU_DOUT_11_L                  0x26U
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t dout11                       : 8;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t dout11                       : 8;
#endif /* DRV_BYTE_ORDER */
} lsm6dso16is_ispu_dout_11_l_t;

#define LSM6DSO16IS_ISPU_DOUT_11_H                  0x27U
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t dout11                       : 8;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t dout11                       : 8;
#endif /* DRV_BYTE_ORDER */
} lsm6dso16is_ispu_dout_11_h_t;

#define LSM6DSO16IS_ISPU_DOUT_12_L                  0x28U
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t dout12                       : 8;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t dout12                       : 8;
#endif /* DRV_BYTE_ORDER */
} lsm6dso16is_ispu_dout_12_l_t;

#define LSM6DSO16IS_ISPU_DOUT_12_H                  0x29U
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t dout12                       : 8;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t dout12                       : 8;
#endif /* DRV_BYTE_ORDER */
} lsm6dso16is_ispu_dout_12_h_t;

#define LSM6DSO16IS_ISPU_DOUT_13_L                  0x2AU
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t dout13                       : 8;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t dout13                       : 8;
#endif /* DRV_BYTE_ORDER */
} lsm6dso16is_ispu_dout_13_l_t;

#define LSM6DSO16IS_ISPU_DOUT_13_H                  0x2BU
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t dout13                       : 8;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t dout13                       : 8;
#endif /* DRV_BYTE_ORDER */
} lsm6dso16is_ispu_dout_13_h_t;

#define LSM6DSO16IS_ISPU_DOUT_14_L                  0x2CU
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t dout14                       : 8;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t dout14                       : 8;
#endif /* DRV_BYTE_ORDER */
} lsm6dso16is_ispu_dout_14_l_t;

#define LSM6DSO16IS_ISPU_DOUT_14_H                  0x2DU
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t dout14                       : 8;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t dout14                       : 8;
#endif /* DRV_BYTE_ORDER */
} lsm6dso16is_ispu_dout_14_h_t;

#define LSM6DSO16IS_ISPU_DOUT_15_L                  0x2EU
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t dout15                       : 8;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t dout15                       : 8;
#endif /* DRV_BYTE_ORDER */
} lsm6dso16is_ispu_dout_15_l_t;

#define LSM6DSO16IS_ISPU_DOUT_15_H                  0x2FU
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t dout15                       : 8;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t dout15                       : 8;
#endif /* DRV_BYTE_ORDER */
} lsm6dso16is_ispu_dout_15_h_t;

#define LSM6DSO16IS_ISPU_DOUT_16_L                  0x30U
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t dout16                       : 8;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t dout16                       : 8;
#endif /* DRV_BYTE_ORDER */
} lsm6dso16is_ispu_dout_16_l_t;

#define LSM6DSO16IS_ISPU_DOUT_16_H                  0x31U
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t dout16                       : 8;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t dout16                       : 8;
#endif /* DRV_BYTE_ORDER */
} lsm6dso16is_ispu_dout_16_h_t;

#define LSM6DSO16IS_ISPU_DOUT_17_L                  0x32U
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t dout17                       : 8;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t dout17                       : 8;
#endif /* DRV_BYTE_ORDER */
} lsm6dso16is_ispu_dout_17_l_t;

#define LSM6DSO16IS_ISPU_DOUT_17_H                  0x33U
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t dout17                       : 8;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t dout17                       : 8;
#endif /* DRV_BYTE_ORDER */
} lsm6dso16is_ispu_dout_17_h_t;

#define LSM6DSO16IS_ISPU_DOUT_18_L                  0x34U
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t dout18                       : 8;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t dout18                       : 8;
#endif /* DRV_BYTE_ORDER */
} lsm6dso16is_ispu_dout_18_l_t;

#define LSM6DSO16IS_ISPU_DOUT_18_H                  0x35U
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t dout18                       : 8;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t dout18                       : 8;
#endif /* DRV_BYTE_ORDER */
} lsm6dso16is_ispu_dout_18_h_t;

#define LSM6DSO16IS_ISPU_DOUT_19_L                  0x36U
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t dout19                       : 8;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t dout19                       : 8;
#endif /* DRV_BYTE_ORDER */
} lsm6dso16is_ispu_dout_19_l_t;

#define LSM6DSO16IS_ISPU_DOUT_19_H                  0x37U
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t dout19                       : 8;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t dout19                       : 8;
#endif /* DRV_BYTE_ORDER */
} lsm6dso16is_ispu_dout_19_h_t;

