newguccio/MEMS_STM32_Practice/Drivers/BSP/Components/lsm6dso16is/lsm6dso16is_reg.h
#define LSM6DSO16IS_ISPU_DOUT_20_L                  0x38U
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t dout20                       : 8;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t dout20                       : 8;
#endif /* DRV_BYTE_ORDER */
} lsm6dso16is_ispu_dout_20_l_t;

#define LSM6DSO16IS_ISPU_DOUT_20_H                  0x39U
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t dout20                       : 8;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t dout20                       : 8;
#endif /* DRV_BYTE_ORDER */
} lsm6dso16is_ispu_dout_20_h_t;

#define LSM6DSO16IS_ISPU_DOUT_21_L                  0x3AU
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t dout21                       : 8;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t dout21                       : 8;
#endif /* DRV_BYTE_ORDER */
} lsm6dso16is_ispu_dout_21_l_t;

#define LSM6DSO16IS_ISPU_DOUT_21_H                  0x3BU
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t dout21                       : 8;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t dout21                       : 8;
#endif /* DRV_BYTE_ORDER */
} lsm6dso16is_ispu_dout_21_h_t;

#define LSM6DSO16IS_ISPU_DOUT_22_L                  0x3CU
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t dout22                       : 8;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t dout22                       : 8;
#endif /* DRV_BYTE_ORDER */
} lsm6dso16is_ispu_dout_22_l_t;

#define LSM6DSO16IS_ISPU_DOUT_22_H                  0x3DU
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t dout22                       : 8;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t dout22                       : 8;
#endif /* DRV_BYTE_ORDER */
} lsm6dso16is_ispu_dout_22_h_t;

#define LSM6DSO16IS_ISPU_DOUT_23_L                  0x3EU
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t dout23                       : 8;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t dout23                       : 8;
#endif /* DRV_BYTE_ORDER */
} lsm6dso16is_ispu_dout_23_l_t;

#define LSM6DSO16IS_ISPU_DOUT_23_H                  0x3FU
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t dout23                       : 8;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t dout23                       : 8;
#endif /* DRV_BYTE_ORDER */
} lsm6dso16is_ispu_dout_23_h_t;

#define LSM6DSO16IS_ISPU_DOUT_24_L                  0x40U
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t dout24                       : 8;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t dout24                       : 8;
#endif /* DRV_BYTE_ORDER */
} lsm6dso16is_ispu_dout_24_l_t;

#define LSM6DSO16IS_ISPU_DOUT_24_H                  0x41U
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t dout24                       : 8;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t dout24                       : 8;
#endif /* DRV_BYTE_ORDER */
} lsm6dso16is_ispu_dout_24_h_t;

#define LSM6DSO16IS_ISPU_DOUT_25_L                  0x42U
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t dout25                       : 8;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t dout25                       : 8;
#endif /* DRV_BYTE_ORDER */
} lsm6dso16is_ispu_dout_25_l_t;

#define LSM6DSO16IS_ISPU_DOUT_25_H                  0x43U
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t dout25                       : 8;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t dout25                       : 8;
#endif /* DRV_BYTE_ORDER */
} lsm6dso16is_ispu_dout_25_h_t;

#define LSM6DSO16IS_ISPU_DOUT_26_L                  0x44U
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t dout26                       : 8;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t dout26                       : 8;
#endif /* DRV_BYTE_ORDER */
} lsm6dso16is_ispu_dout_26_l_t;

#define LSM6DSO16IS_ISPU_DOUT_26_H                  0x45U
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t dout26                       : 8;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t dout26                       : 8;
#endif /* DRV_BYTE_ORDER */
} lsm6dso16is_ispu_dout_26_h_t;

#define LSM6DSO16IS_ISPU_DOUT_27_L                  0x46U
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t dout27                       : 8;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t dout27                       : 8;
#endif /* DRV_BYTE_ORDER */
} lsm6dso16is_ispu_dout_27_l_t;

#define LSM6DSO16IS_ISPU_DOUT_27_H                  0x47U
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t dout27                       : 8;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t dout27                       : 8;
#endif /* DRV_BYTE_ORDER */
} lsm6dso16is_ispu_dout_27_h_t;

#define LSM6DSO16IS_ISPU_DOUT_28_L                  0x48U
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t dout28                       : 8;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t dout28                       : 8;
#endif /* DRV_BYTE_ORDER */
} lsm6dso16is_ispu_dout_28_l_t;

#define LSM6DSO16IS_ISPU_DOUT_28_H                  0x49U
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t dout28                       : 8;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t dout28                       : 8;
#endif /* DRV_BYTE_ORDER */
} lsm6dso16is_ispu_dout_28_h_t;

#define LSM6DSO16IS_ISPU_DOUT_29_L                  0x4AU
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t dout29                       : 8;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t dout29                       : 8;
#endif /* DRV_BYTE_ORDER */
} lsm6dso16is_ispu_dout_29_l_t;

#define LSM6DSO16IS_ISPU_DOUT_29_H                  0x4BU
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t dout29                       : 8;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t dout29                       : 8;
#endif /* DRV_BYTE_ORDER */
} lsm6dso16is_ispu_dout_29_h_t;

#define LSM6DSO16IS_ISPU_DOUT_30_L                  0x4CU
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t dout30                       : 8;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t dout30                       : 8;
#endif /* DRV_BYTE_ORDER */
} lsm6dso16is_ispu_dout_30_l_t;

#define LSM6DSO16IS_ISPU_DOUT_30_H                  0x4DU
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t dout30                       : 8;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t dout30                       : 8;
#endif /* DRV_BYTE_ORDER */
} lsm6dso16is_ispu_dout_30_h_t;

