newguccio/MEMS_STM32_Practice/Drivers/BSP/Components/lsm6dso16is/lsm6dso16is_reg.h
#define LSM6DSO16IS_ISPU_DOUT_31_L                  0x4EU
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t dout31                       : 8;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t dout31                       : 8;
#endif /* DRV_BYTE_ORDER */
} lsm6dso16is_ispu_dout_31_l_t;

#define LSM6DSO16IS_ISPU_DOUT_31_H                  0x4FU
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t dout31                       : 8;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t dout31                       : 8;
#endif /* DRV_BYTE_ORDER */
} lsm6dso16is_ispu_dout_31_h_t;

#define LSM6DSO16IS_ISPU_INT1_CTRL0                 0x50U
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t ispu_int1_ctrl               : 8;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t ispu_int1_ctrl               : 8;
#endif /* DRV_BYTE_ORDER */
} lsm6dso16is_ispu_int1_ctrl0_t;

#define LSM6DSO16IS_ISPU_INT1_CTRL1                 0x51U
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t ispu_int1_ctrl               : 8;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t ispu_int1_ctrl               : 8;
#endif /* DRV_BYTE_ORDER */
} lsm6dso16is_ispu_int1_ctrl1_t;

#define LSM6DSO16IS_ISPU_INT1_CTRL2                 0x52U
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t ispu_int1_ctrl               : 8;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t ispu_int1_ctrl               : 8;
#endif /* DRV_BYTE_ORDER */
} lsm6dso16is_ispu_int1_ctrl2_t;

#define LSM6DSO16IS_ISPU_INT1_CTRL3                 0x53U
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t ispu_int1_ctrl               : 6;
  uint8_t not_used0                    : 2;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t not_used0                    : 2;
  uint8_t ispu_int1_ctrl               : 6;
#endif /* DRV_BYTE_ORDER */
} lsm6dso16is_ispu_int1_ctrl3_t;

#define LSM6DSO16IS_ISPU_INT2_CTRL0                 0x54U
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t ispu_int2_ctrl               : 8;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t ispu_int2_ctrl               : 8;
#endif /* DRV_BYTE_ORDER */
} lsm6dso16is_ispu_int2_ctrl0_t;

#define LSM6DSO16IS_ISPU_INT2_CTRL1                 0x55U
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t ispu_int2_ctrl               : 8;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t ispu_int2_ctrl               : 8;
#endif /* DRV_BYTE_ORDER */
} lsm6dso16is_ispu_int2_ctrl1_t;

#define LSM6DSO16IS_ISPU_INT2_CTRL2                 0x56U
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t ispu_int2_ctrl               : 8;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t ispu_int2_ctrl               : 8;
#endif /* DRV_BYTE_ORDER */
} lsm6dso16is_ispu_int2_ctrl2_t;

#define LSM6DSO16IS_ISPU_INT2_CTRL3                 0x57U
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t ispu_int2_ctrl               : 6;
  uint8_t not_used0                    : 2;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t not_used0                    : 2;
  uint8_t ispu_int2_ctrl               : 6;
#endif /* DRV_BYTE_ORDER */
} lsm6dso16is_ispu_int2_ctrl3_t;

#define LSM6DSO16IS_ISPU_INT_STATUS0                0x58U
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t ispu_int_status              : 8;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t ispu_int_status              : 8;
#endif /* DRV_BYTE_ORDER */
} lsm6dso16is_ispu_int_status0_t;

#define LSM6DSO16IS_ISPU_INT_STATUS1                0x59U
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t ispu_int_status              : 8;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t ispu_int_status              : 8;
#endif /* DRV_BYTE_ORDER */
} lsm6dso16is_ispu_int_status1_t;

#define LSM6DSO16IS_ISPU_INT_STATUS2                0x5AU
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t ispu_int_status              : 8;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t ispu_int_status              : 8;
#endif /* DRV_BYTE_ORDER */
} lsm6dso16is_ispu_int_status2_t;

#define LSM6DSO16IS_ISPU_INT_STATUS3                0x5BU
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t ispu_int_status              : 6;
  uint8_t not_used0                    : 2;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t not_used0                    : 2;
  uint8_t ispu_int_status              : 6;
#endif /* DRV_BYTE_ORDER */
} lsm6dso16is_ispu_int_status3_t;

#define LSM6DSO16IS_ISPU_ALGO0                      0x70U
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t ispu_algo                    : 8;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t ispu_algo                    : 8;
#endif /* DRV_BYTE_ORDER */
} lsm6dso16is_ispu_algo0_t;

#define LSM6DSO16IS_ISPU_ALGO1                      0x71U
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t ispu_algo                    : 8;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t ispu_algo                    : 8;
#endif /* DRV_BYTE_ORDER */
} lsm6dso16is_ispu_algo1_t;

#define LSM6DSO16IS_ISPU_ALGO2                      0x72U
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t ispu_algo                    : 8;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t ispu_algo                    : 8;
#endif /* DRV_BYTE_ORDER */
} lsm6dso16is_ispu_algo2_t;

#define LSM6DSO16IS_ISPU_ALGO3                      0x73U
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t ispu_algo                    : 6;
  uint8_t not_used0                    : 2;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t not_used0                    : 2;
  uint8_t ispu_algo                    : 6;
#endif /* DRV_BYTE_ORDER */
} lsm6dso16is_ispu_algo3_t;

/**
  * @}
  *
  */

typedef union
{
  lsm6dso16is_func_cfg_access_t    func_cfg_access;
  lsm6dso16is_pin_ctrl_t    pin_ctrl;
  lsm6dso16is_drdy_pulsed_reg_t    drdy_pulsed_reg;
  lsm6dso16is_int1_ctrl_t    int1_ctrl;
  lsm6dso16is_int2_ctrl_t    int2_ctrl;
  lsm6dso16is_who_am_i_t    who_am_i;
  lsm6dso16is_ctrl1_xl_t    ctrl1_xl;
  lsm6dso16is_ctrl2_g_t    ctrl2_g;
  lsm6dso16is_ctrl3_c_t    ctrl3_c;
  lsm6dso16is_ctrl4_c_t    ctrl4_c;
  lsm6dso16is_ctrl5_c_t    ctrl5_c;
  lsm6dso16is_ctrl6_c_t    ctrl6_c;
  lsm6dso16is_ctrl7_g_t    ctrl7_g;
  lsm6dso16is_ctrl9_c_t    ctrl9_c;
  lsm6dso16is_ctrl10_c_t    ctrl10_c;
  lsm6dso16is_ispu_int_status0_mainpage_t    ispu_int_status0_mainpage;
  lsm6dso16is_ispu_int_status1_mainpage_t    ispu_int_status1_mainpage;
  lsm6dso16is_ispu_int_status2_mainpage_t    ispu_int_status2_mainpage;
  lsm6dso16is_ispu_int_status3_mainpage_t    ispu_int_status3_mainpage;
  lsm6dso16is_status_reg_t    status_reg;
  lsm6dso16is_out_temp_l_t    out_temp_l;
  lsm6dso16is_out_temp_h_t    out_temp_h;
  lsm6dso16is_outx_l_g_t    outx_l_g;
  lsm6dso16is_outx_h_g_t    outx_h_g;
  lsm6dso16is_outy_l_g_t    outy_l_g;
  lsm6dso16is_outy_h_g_t    outy_h_g;
  lsm6dso16is_outz_l_g_t    outz_l_g;
  lsm6dso16is_outz_h_g_t    outz_h_g;
  lsm6dso16is_outx_l_a_t    outx_l_a;
  lsm6dso16is_outx_h_a_t    outx_h_a;
  lsm6dso16is_outy_l_a_t    outy_l_a;
  lsm6dso16is_outy_h_a_t    outy_h_a;
  lsm6dso16is_outz_l_a_t    outz_l_a;
  lsm6dso16is_outz_h_a_t    outz_h_a;
  lsm6dso16is_status_master_mainpage_t    status_master_mainpage;
  lsm6dso16is_timestamp0_t    timestamp0;
  lsm6dso16is_timestamp1_t    timestamp1;
  lsm6dso16is_timestamp2_t    timestamp2;
  lsm6dso16is_timestamp3_t    timestamp3;
  lsm6dso16is_md1_cfg_t    md1_cfg;
  lsm6dso16is_md2_cfg_t    md2_cfg;
  lsm6dso16is_internal_freq_fine_t            internal_freq_fine;
  lsm6dso16is_ispu_dummy_cfg_1_l_t    ispu_dummy_cfg_1_l;
  lsm6dso16is_ispu_dummy_cfg_1_h_t    ispu_dummy_cfg_1_h;
  lsm6dso16is_ispu_dummy_cfg_2_l_t    ispu_dummy_cfg_2_l;
  lsm6dso16is_ispu_dummy_cfg_2_h_t    ispu_dummy_cfg_2_h;
  lsm6dso16is_ispu_dummy_cfg_3_l_t    ispu_dummy_cfg_3_l;
  lsm6dso16is_ispu_dummy_cfg_3_h_t    ispu_dummy_cfg_3_h;
  lsm6dso16is_ispu_dummy_cfg_4_l_t    ispu_dummy_cfg_4_l;
  lsm6dso16is_ispu_dummy_cfg_4_h_t    ispu_dummy_cfg_4_h;
  lsm6dso16is_sensor_hub_1_t    sensor_hub_1;
  lsm6dso16is_sensor_hub_2_t    sensor_hub_2;
  lsm6dso16is_sensor_hub_3_t    sensor_hub_3;
  lsm6dso16is_sensor_hub_4_t    sensor_hub_4;
  lsm6dso16is_sensor_hub_5_t    sensor_hub_5;
  lsm6dso16is_sensor_hub_6_t    sensor_hub_6;
  lsm6dso16is_sensor_hub_7_t    sensor_hub_7;
  lsm6dso16is_sensor_hub_8_t    sensor_hub_8;
  lsm6dso16is_sensor_hub_9_t    sensor_hub_9;
  lsm6dso16is_sensor_hub_10_t    sensor_hub_10;
  lsm6dso16is_sensor_hub_11_t    sensor_hub_11;
  lsm6dso16is_sensor_hub_12_t    sensor_hub_12;
  lsm6dso16is_sensor_hub_13_t    sensor_hub_13;
  lsm6dso16is_sensor_hub_14_t    sensor_hub_14;
  lsm6dso16is_sensor_hub_15_t    sensor_hub_15;
  lsm6dso16is_sensor_hub_16_t    sensor_hub_16;
  lsm6dso16is_sensor_hub_17_t    sensor_hub_17;
  lsm6dso16is_sensor_hub_18_t    sensor_hub_18;
  lsm6dso16is_master_config_t    master_config;
  lsm6dso16is_slv0_add_t    slv0_add;
  lsm6dso16is_slv0_subadd_t    slv0_subadd;
  lsm6dso16is_slv0_config_t    slv0_config;
  lsm6dso16is_slv1_add_t    slv1_add;
  lsm6dso16is_slv1_subadd_t    slv1_subadd;
  lsm6dso16is_slv1_config_t    slv1_config;
  lsm6dso16is_slv2_add_t    slv2_add;
  lsm6dso16is_slv2_subadd_t    slv2_subadd;
  lsm6dso16is_slv2_config_t    slv2_config;
  lsm6dso16is_slv3_add_t    slv3_add;
  lsm6dso16is_slv3_subadd_t    slv3_subadd;
  lsm6dso16is_slv3_config_t    slv3_config;
  lsm6dso16is_datawrite_slv0_t    datawrite_slv0;
  lsm6dso16is_status_master_t    status_master;
  lsm6dso16is_ispu_config_t    ispu_config;
  lsm6dso16is_ispu_status_t    ispu_status;
  lsm6dso16is_ispu_mem_sel_t    ispu_mem_sel;
  lsm6dso16is_ispu_mem_addr1_t    ispu_mem_addr1;
  lsm6dso16is_ispu_mem_addr0_t    ispu_mem_addr0;
  lsm6dso16is_ispu_mem_data_t    ispu_mem_data;
  lsm6dso16is_ispu_if2s_flag_l_t    ispu_if2s_flag_l;
  lsm6dso16is_ispu_if2s_flag_h_t    ispu_if2s_flag_h;
  lsm6dso16is_ispu_s2if_flag_l_t    ispu_s2if_flag_l;
  lsm6dso16is_ispu_s2if_flag_h_t    ispu_s2if_flag_h;
  lsm6dso16is_ispu_dout_00_l_t    ispu_dout_00_l;
  lsm6dso16is_ispu_dout_00_h_t    ispu_dout_00_h;
  lsm6dso16is_ispu_dout_01_l_t    ispu_dout_01_l;
  lsm6dso16is_ispu_dout_01_h_t    ispu_dout_01_h;
  lsm6dso16is_ispu_dout_02_l_t    ispu_dout_02_l;
  lsm6dso16is_ispu_dout_02_h_t    ispu_dout_02_h;
  lsm6dso16is_ispu_dout_03_l_t    ispu_dout_03_l;
  lsm6dso16is_ispu_dout_03_h_t    ispu_dout_03_h;
  lsm6dso16is_ispu_dout_04_l_t    ispu_dout_04_l;
  lsm6dso16is_ispu_dout_04_h_t    ispu_dout_04_h;
  lsm6dso16is_ispu_dout_05_l_t    ispu_dout_05_l;
  lsm6dso16is_ispu_dout_05_h_t    ispu_dout_05_h;
  lsm6dso16is_ispu_dout_06_l_t    ispu_dout_06_l;
  lsm6dso16is_ispu_dout_06_h_t    ispu_dout_06_h;
  lsm6dso16is_ispu_dout_07_l_t    ispu_dout_07_l;
  lsm6dso16is_ispu_dout_07_h_t    ispu_dout_07_h;
  lsm6dso16is_ispu_dout_08_l_t    ispu_dout_08_l;
  lsm6dso16is_ispu_dout_08_h_t    ispu_dout_08_h;
  lsm6dso16is_ispu_dout_09_l_t    ispu_dout_09_l;
  lsm6dso16is_ispu_dout_09_h_t    ispu_dout_09_h;
  lsm6dso16is_ispu_dout_10_l_t    ispu_dout_10_l;
  lsm6dso16is_ispu_dout_10_h_t    ispu_dout_10_h;
  lsm6dso16is_ispu_dout_11_l_t    ispu_dout_11_l;
  lsm6dso16is_ispu_dout_11_h_t    ispu_dout_11_h;
  lsm6dso16is_ispu_dout_12_l_t    ispu_dout_12_l;
  lsm6dso16is_ispu_dout_12_h_t    ispu_dout_12_h;
  lsm6dso16is_ispu_dout_13_l_t    ispu_dout_13_l;
  lsm6dso16is_ispu_dout_13_h_t    ispu_dout_13_h;
  lsm6dso16is_ispu_dout_14_l_t    ispu_dout_14_l;
  lsm6dso16is_ispu_dout_14_h_t    ispu_dout_14_h;
  lsm6dso16is_ispu_dout_15_l_t    ispu_dout_15_l;
  lsm6dso16is_ispu_dout_15_h_t    ispu_dout_15_h;
  lsm6dso16is_ispu_dout_16_l_t    ispu_dout_16_l;
  lsm6dso16is_ispu_dout_16_h_t    ispu_dout_16_h;
  lsm6dso16is_ispu_dout_17_l_t    ispu_dout_17_l;
  lsm6dso16is_ispu_dout_17_h_t    ispu_dout_17_h;
  lsm6dso16is_ispu_dout_18_l_t    ispu_dout_18_l;
  lsm6dso16is_ispu_dout_18_h_t    ispu_dout_18_h;
  lsm6dso16is_ispu_dout_19_l_t    ispu_dout_19_l;
  lsm6dso16is_ispu_dout_19_h_t    ispu_dout_19_h;
  lsm6dso16is_ispu_dout_20_l_t    ispu_dout_20_l;
  lsm6dso16is_ispu_dout_20_h_t    ispu_dout_20_h;
  lsm6dso16is_ispu_dout_21_l_t    ispu_dout_21_l;
  lsm6dso16is_ispu_dout_21_h_t    ispu_dout_21_h;
  lsm6dso16is_ispu_dout_22_l_t    ispu_dout_22_l;
  lsm6dso16is_ispu_dout_22_h_t    ispu_dout_22_h;
  lsm6dso16is_ispu_dout_23_l_t    ispu_dout_23_l;
  lsm6dso16is_ispu_dout_23_h_t    ispu_dout_23_h;
  lsm6dso16is_ispu_dout_24_l_t    ispu_dout_24_l;
  lsm6dso16is_ispu_dout_24_h_t    ispu_dout_24_h;
  lsm6dso16is_ispu_dout_25_l_t    ispu_dout_25_l;
  lsm6dso16is_ispu_dout_25_h_t    ispu_dout_25_h;
  lsm6dso16is_ispu_dout_26_l_t    ispu_dout_26_l;
  lsm6dso16is_ispu_dout_26_h_t    ispu_dout_26_h;
  lsm6dso16is_ispu_dout_27_l_t    ispu_dout_27_l;
  lsm6dso16is_ispu_dout_27_h_t    ispu_dout_27_h;
  lsm6dso16is_ispu_dout_28_l_t    ispu_dout_28_l;
  lsm6dso16is_ispu_dout_28_h_t    ispu_dout_28_h;
  lsm6dso16is_ispu_dout_29_l_t    ispu_dout_29_l;
  lsm6dso16is_ispu_dout_29_h_t    ispu_dout_29_h;
  lsm6dso16is_ispu_dout_30_l_t    ispu_dout_30_l;
  lsm6dso16is_ispu_dout_30_h_t    ispu_dout_30_h;
  lsm6dso16is_ispu_dout_31_l_t    ispu_dout_31_l;
  lsm6dso16is_ispu_dout_31_h_t    ispu_dout_31_h;
  lsm6dso16is_ispu_int1_ctrl0_t    ispu_int1_ctrl0;
  lsm6dso16is_ispu_int1_ctrl1_t    ispu_int1_ctrl1;
  lsm6dso16is_ispu_int1_ctrl2_t    ispu_int1_ctrl2;
  lsm6dso16is_ispu_int1_ctrl3_t    ispu_int1_ctrl3;
  lsm6dso16is_ispu_int2_ctrl0_t    ispu_int2_ctrl0;
  lsm6dso16is_ispu_int2_ctrl1_t    ispu_int2_ctrl1;
  lsm6dso16is_ispu_int2_ctrl2_t    ispu_int2_ctrl2;
  lsm6dso16is_ispu_int2_ctrl3_t    ispu_int2_ctrl3;
  lsm6dso16is_ispu_int_status0_t    ispu_int_status0;
  lsm6dso16is_ispu_int_status1_t    ispu_int_status1;
  lsm6dso16is_ispu_int_status2_t    ispu_int_status2;
  lsm6dso16is_ispu_int_status3_t    ispu_int_status3;
  lsm6dso16is_ispu_algo0_t    ispu_algo0;
  lsm6dso16is_ispu_algo1_t    ispu_algo1;
  lsm6dso16is_ispu_algo2_t    ispu_algo2;
  lsm6dso16is_ispu_algo3_t    ispu_algo3;
  bitwise_t    bitwise;
  uint8_t    byte;
} lsm6dso16is_reg_t;

/**
  * @}
  *
  */

#ifndef __weak
#define __weak __attribute__((weak))
#endif /* __weak */

