newguccio/MEMS_STM32_Practice/Drivers/BSP/Components/lsm6dso16is/lsm6dso16is_reg.h
int32_t lsm6dso16is_gy_data_rate_set(const stmdev_ctx_t *ctx,
                                     lsm6dso16is_gy_data_rate_t val);
int32_t lsm6dso16is_gy_data_rate_get(const stmdev_ctx_t *ctx,
                                     lsm6dso16is_gy_data_rate_t *val);

int32_t lsm6dso16is_auto_increment_set(const stmdev_ctx_t *ctx, uint8_t val);
int32_t lsm6dso16is_auto_increment_get(const stmdev_ctx_t *ctx, uint8_t *val);

int32_t lsm6dso16is_block_data_update_set(const stmdev_ctx_t *ctx, uint8_t val);
int32_t lsm6dso16is_block_data_update_get(const stmdev_ctx_t *ctx, uint8_t *val);

typedef enum
{
  LSM6DSO16IS_SLEEP_G_ENABLE =            0x0,
  LSM6DSO16IS_SLEEP_G_DISABLE =           0x1,
} lsm6dso16is_sleep_t;
int32_t lsm6dso16is_sleep_set(const stmdev_ctx_t *ctx, lsm6dso16is_sleep_t val);
int32_t lsm6dso16is_sleep_get(const stmdev_ctx_t *ctx, lsm6dso16is_sleep_t *val);

typedef enum
{
  LSM6DSO16IS_XL_ST_DISABLE =             0x0,
  LSM6DSO16IS_XL_ST_POSITIVE =            0x1,
  LSM6DSO16IS_XL_ST_NEGATIVE =            0x2,
} lsm6dso16is_xl_self_test_t;
int32_t lsm6dso16is_xl_self_test_set(const stmdev_ctx_t *ctx,
                                     lsm6dso16is_xl_self_test_t val);
int32_t lsm6dso16is_xl_self_test_get(const stmdev_ctx_t *ctx,
                                     lsm6dso16is_xl_self_test_t *val);

typedef enum
{
  LSM6DSO16IS_GY_ST_DISABLE =             0x0,
  LSM6DSO16IS_GY_ST_POSITIVE =            0x1,
  LSM6DSO16IS_GY_ST_NEGATIVE =            0x3,
} lsm6dso16is_gy_self_test_t;
int32_t lsm6dso16is_gy_self_test_set(const stmdev_ctx_t *ctx,
                                     lsm6dso16is_gy_self_test_t val);
int32_t lsm6dso16is_gy_self_test_get(const stmdev_ctx_t *ctx,
                                     lsm6dso16is_gy_self_test_t *val);

int32_t lsm6dso16is_ui_sdo_pull_up_set(const stmdev_ctx_t *ctx, uint8_t val);
int32_t lsm6dso16is_ui_sdo_pull_up_get(const stmdev_ctx_t *ctx, uint8_t *val);

typedef enum
{
  LSM6DSO16IS_SPI_4_WIRE =                0x0,
  LSM6DSO16IS_SPI_3_WIRE =                0x1,
} lsm6dso16is_spi_mode_t;
int32_t lsm6dso16is_spi_mode_set(const stmdev_ctx_t *ctx, lsm6dso16is_spi_mode_t val);
int32_t lsm6dso16is_spi_mode_get(const stmdev_ctx_t *ctx, lsm6dso16is_spi_mode_t *val);

typedef enum
{
  LSM6DSO16IS_I2C_ENABLE =                0x0,
  LSM6DSO16IS_I2C_DISABLE =               0x1,
} lsm6dso16is_ui_i2c_mode_t;
int32_t lsm6dso16is_ui_i2c_mode_set(const stmdev_ctx_t *ctx, lsm6dso16is_ui_i2c_mode_t val);
int32_t lsm6dso16is_ui_i2c_mode_get(const stmdev_ctx_t *ctx,
                                    lsm6dso16is_ui_i2c_mode_t *val);


int32_t lsm6dso16is_timestamp_set(const stmdev_ctx_t *ctx, uint8_t val);
int32_t lsm6dso16is_timestamp_get(const stmdev_ctx_t *ctx, uint8_t *val);

int32_t lsm6dso16is_timestamp_raw_get(const stmdev_ctx_t *ctx, uint32_t *val);

typedef struct
{
  uint8_t drdy_xl                      : 1;
  uint8_t drdy_gy                      : 1;
  uint8_t boot                         : 1;
  uint8_t sh_endop                     : 1;
  uint8_t ispu                         : 1;
} lsm6dso16is_pin_int1_route_t;
int32_t lsm6dso16is_pin_int1_route_set(const stmdev_ctx_t *ctx,
                                       lsm6dso16is_pin_int1_route_t val);
int32_t lsm6dso16is_pin_int1_route_get(const stmdev_ctx_t *ctx,
                                       lsm6dso16is_pin_int1_route_t *val);

typedef struct
{
  uint8_t drdy_xl                      : 1;
  uint8_t drdy_gy                      : 1;
  uint8_t drdy_temp                    : 1;
  uint8_t timestamp                    : 1;
  uint8_t ispu_sleep                   : 1;
  uint8_t ispu                         : 1;
} lsm6dso16is_pin_int2_route_t;
int32_t lsm6dso16is_pin_int2_route_set(const stmdev_ctx_t *ctx,
                                       lsm6dso16is_pin_int2_route_t val);
int32_t lsm6dso16is_pin_int2_route_get(const stmdev_ctx_t *ctx,
                                       lsm6dso16is_pin_int2_route_t *val);

typedef enum
{
  LSM6DSO16IS_PUSH_PULL =                 0x0,
  LSM6DSO16IS_OPEN_DRAIN =                0x1,
} lsm6dso16is_int_pin_mode_t;
int32_t lsm6dso16is_int_pin_mode_set(const stmdev_ctx_t *ctx,
                                     lsm6dso16is_int_pin_mode_t val);
int32_t lsm6dso16is_int_pin_mode_get(const stmdev_ctx_t *ctx,
                                     lsm6dso16is_int_pin_mode_t *val);

typedef enum
{
  LSM6DSO16IS_ACTIVE_HIGH =               0x0,
  LSM6DSO16IS_ACTIVE_LOW =                0x1,
} lsm6dso16is_pin_polarity_t;
int32_t lsm6dso16is_pin_polarity_set(const stmdev_ctx_t *ctx,
                                     lsm6dso16is_pin_polarity_t val);
int32_t lsm6dso16is_pin_polarity_get(const stmdev_ctx_t *ctx,
                                     lsm6dso16is_pin_polarity_t *val);

typedef struct
{
  uint8_t drdy_xl                      : 1;
  uint8_t drdy_gy                      : 1;
  uint8_t drdy_temp                    : 1;
  uint8_t sh_endop                     : 1;
  uint8_t sh_slave0_nack               : 1;
  uint8_t sh_slave1_nack               : 1;
  uint8_t sh_slave2_nack               : 1;
  uint8_t sh_slave3_nack               : 1;
  uint8_t sh_wr_once                   : 1;
  uint32_t ispu                        : 30;
} lsm6dso16is_all_sources_t;
int32_t lsm6dso16is_all_sources_get(const stmdev_ctx_t *ctx,
                                    lsm6dso16is_all_sources_t *val);

int32_t lsm6dso16is_status_reg_get(const stmdev_ctx_t *ctx,
                                   lsm6dso16is_status_reg_t *val);

int32_t lsm6dso16is_xl_flag_data_ready_get(const stmdev_ctx_t *ctx,
                                           uint8_t *val);

int32_t lsm6dso16is_gy_flag_data_ready_get(const stmdev_ctx_t *ctx,
                                           uint8_t *val);

int32_t lsm6dso16is_temp_flag_data_ready_get(const stmdev_ctx_t *ctx,
                                             uint8_t *val);

int32_t lsm6dso16is_temperature_raw_get(const stmdev_ctx_t *ctx, int16_t *val);

int32_t lsm6dso16is_angular_rate_raw_get(const stmdev_ctx_t *ctx, int16_t *val);

int32_t lsm6dso16is_acceleration_raw_get(const stmdev_ctx_t *ctx, int16_t *val);

int32_t lsm6dso16is_odr_cal_reg_set(const stmdev_ctx_t *ctx, uint8_t val);
int32_t lsm6dso16is_odr_cal_reg_get(const stmdev_ctx_t *ctx, uint8_t *val);

