newguccio/MEMS_STM32_Practice/Drivers/BSP/Components/lsm6dso16is/lsm6dso16is_reg.h
typedef enum
{
  LSM6DSO16IS_ISPU_INT_PULSED =           0x0,
  LSM6DSO16IS_ISPU_INT_LATCHED =          0x1,
} lsm6dso16is_ispu_int_latched_t;
int32_t lsm6dso16is_ispu_int_latched_set(const stmdev_ctx_t *ctx,
                                         lsm6dso16is_ispu_int_latched_t val);
int32_t lsm6dso16is_ispu_int_latched_get(const stmdev_ctx_t *ctx,
                                         lsm6dso16is_ispu_int_latched_t *val);

typedef enum
{
  LSM6DSO16IS_ISPU_BOOT_IN_PROGRESS =     0x0,
  LSM6DSO16IS_ISPU_BOOT_ENDED =           0x1,
} lsm6dso16is_ispu_boot_end_t;
int32_t lsm6dso16is_ispu_get_boot_status(const stmdev_ctx_t *ctx,
                                         lsm6dso16is_ispu_boot_end_t *val);

typedef enum
{
  LSM6DSO16IS_ISPU_DATA_RAM_MEMORY =      0x0,
  LSM6DSO16IS_ISPU_PROGRAM_RAM_MEMORY =   0x1,
} lsm6dso16is_ispu_memory_type_t;
int32_t lsm6dso16is_ispu_read_memory_enable(const stmdev_ctx_t *ctx,
                                            lsm6dso16is_ispu_memory_type_t val);
int32_t lsm6dso16is_ispu_read_memory_disable(const stmdev_ctx_t *ctx);

int32_t lsm6dso16is_ispu_write_memory(const stmdev_ctx_t *ctx,
                                      lsm6dso16is_ispu_memory_type_t mem_sel,
                                      uint16_t mem_addr, uint8_t *mem_data, uint16_t len);
int32_t lsm6dso16is_ispu_read_memory(const stmdev_ctx_t *ctx,
                                     lsm6dso16is_ispu_memory_type_t mem_sel,
                                     uint16_t mem_addr, uint8_t *mem_data, uint16_t len);

int32_t lsm6dso16is_ispu_write_flags(const stmdev_ctx_t *ctx, uint16_t data);
int32_t lsm6dso16is_ispu_read_flags(const stmdev_ctx_t *ctx, uint16_t *data);
int32_t lsm6dso16is_ispu_clear_flags(const stmdev_ctx_t *ctx);

int32_t lsm6dso16is_ispu_read_data_raw_get(const stmdev_ctx_t *ctx,
                                           uint8_t *val,
                                           uint8_t len);

int32_t lsm6dso16is_ispu_int1_ctrl_get(const stmdev_ctx_t *ctx, uint32_t *val);
int32_t lsm6dso16is_ispu_int1_ctrl_set(const stmdev_ctx_t *ctx, uint32_t val);
int32_t lsm6dso16is_ispu_int2_ctrl_get(const stmdev_ctx_t *ctx, uint32_t *val);
int32_t lsm6dso16is_ispu_int2_ctrl_set(const stmdev_ctx_t *ctx, uint32_t val);

int32_t lsm6dso16is_ispu_int_status_get(const stmdev_ctx_t *ctx, uint32_t *val);

int32_t lsm6dso16is_ispu_algo_get(const stmdev_ctx_t *ctx, uint32_t *val);
int32_t lsm6dso16is_ispu_algo_set(const stmdev_ctx_t *ctx, uint32_t val);
/**
  * @}
  *
  */

#ifdef __cplusplus
}
#endif

#endif /*LSM6DSO16IS_DRIVER_H */
